IDEA Open Model
Vector3D.X Property
Compatible with IDEA StatiCa Beta 20.0
 Gets or sets the X-dirrection value
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector3D Class
IdeaRS.OpenModel.Geometry3D Namespace